InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/бит_ЗащитаПерсональнойИнформации/Ext/Module.bsl
#Область ПроцедурыРаботыСоСправочникомПроживающие

// БИТ_ЖКХ 29.11.2010. 
// записывает в рег-р сведений новые фамилию, имя и отчество
//
Процедура ЗаписатьДанныеФИОВРегистр(Ссылка, Фамилия, Имя, Отчество) Экспорт
	
	ФИОСрез = РегистрыСведений.бит_ФИОПроживающих.ПолучитьПоследнее(,Новый Структура("ФизЛицо",Ссылка));
	
	СтрокаСреза = ФИОСрез.Фамилия + ФИОСрез.Имя + ФИОСрез.Отчество;
	
	Если СтрокаСреза <> (Фамилия + Имя + Отчество) Тогда
		
		МенеджерЗаписи = РегистрыСведений.бит_ФИОПроживающих.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ФизЛицо = Ссылка;
		Если ПустаяСтрока(СтрокаСреза) Тогда
			МенеджерЗаписи.Период = '19800101';
		Иначе
			// БИТ_ЖКХ_20012014_начало_изменений
			// МенеджерЗаписи.Период = РабочаяДата;.
			МенеджерЗаписи.Период = ТекущаяДата();
			// БИТ_ЖКХ_20012014_окончание_изменений
		КонецЕсли;
		
		МенеджерЗаписи.Фамилия = Фамилия;
		МенеджерЗаписи.Имя = Имя;
		МенеджерЗаписи.Отчество = Отчество;
		
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Вычисляет объект для оповещения.
//
// Параметры
//  ФизЛицо - ФизЛицо, данные которого редактируются.
//  ФормаВладелец - вызвавшая форма.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_Проживающие, Форма - ФизЛицо, данные которого редактируются или вызвавшая форма.
//
Функция ОпределитьОповещаемоеФизЛицо(ФизЛицо, ФормаВладелец) Экспорт
	
	// Физлицо может быть уже указано в редактируемой записи регистра.
	Если Не ФизЛицо.Пустая() Тогда
		Возврат ФизЛицо
	КонецЕсли;
	
	// Выясним, какой объект редактируется вызвавшей формой.
	Объект = Неопределено;
	Попытка
		Объект = ФормаВладелец.ЭтотОбъект
	Исключение
		
	КонецПопытки;
	
	ФизЛицоКОповещению = Справочники.бит_Проживающие.ПустаяСсылка();
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("СправочникОбъект.бит_Проживающие") Тогда
		ФизЛицоКОповещению = Объект.Ссылка
		// ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.СотрудникиОрганизаций") Тогда.	
		//	ФизЛицоКОповещению = Объект.ФизЛицо.
	КонецЕсли;
	
	Если Не ФизЛицоКОповещению.Пустая() Тогда
		Возврат ФизЛицоКОповещению
	КонецЕсли;
	
	// Редактируемое физлицо не записано, будем оповещать только вызвавшую форму. 
	Возврат ФормаВладелец
	
КонецФункции // ОпределитьОповещаемыйОбъект()

#КонецОбласти
